HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/externalSolarLoad/constant/air/viewFactorsDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viewFactorsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

writeViewFactorMatrix     true;
writeFacesAgglomeration   true;
writePatchViewFactors     false;

maxDynListLength     200000;
// ************************************************************************* //
