HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/externalSolarLoad/constant/floor/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       on;

radiationModel  opaqueSolid;

absorptionEmissionModel multiBandSolid;

multiBandSolidCoeffs
{
    absorptivity    (0.7 0.7);
    emissivity      (0.7 0.7);
}

transmissivityModel     multiBandSolidTransmissivity;

multiBandSolidTransmissivityCoeffs
{
    transmissivity    (0 0);
}

scatterModel    none;

sootModel none;

// ************************************************************************* //
