HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/externalSolarLoad/0.orig/air/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/air";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0.1 0 0 );

boundaryField
{
    maxY
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    minX
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    maxX
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    minY
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    maxZ
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    air_to_floor
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    air_to_solid
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    region0_to_floor_floor_zone
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
