HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/externalSolarLoad/0.orig/air/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 100000;

boundaryField
{
    maxY
    {
        type            totalPressure;
        p0              $internalField;
    }
    minX
    {
        type            totalPressure;
        p0              $internalField;
    }
    maxX
    {
        type            totalPressure;
        p0              $internalField;
    }
    minY
    {
        type            totalPressure;
        p0              $internalField;
    }
    maxZ
    {
        type            totalPressure;
        p0              $internalField;
    }
    air_to_floor
    {
        type            fixedFluxPressure;
        p0              $internalField;
    }
    air_to_solid
    {
        type            fixedFluxPressure;
        p0              $internalField;
    }
}


// ************************************************************************* //
