HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/externalSolarLoad/0.orig/floor/T
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/floor";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    maxY
    {
        type            zeroGradient;
        value           uniform 300;
    }
    minX
    {
        type            zeroGradient;
        value           uniform 300;
    }
    maxX
    {
        type            zeroGradient;
        value           uniform 300;
    }
    minY
    {
        type            zeroGradient;
        value           uniform 300;
    }
    minZ
    {
        type            externalWallHeatFluxTemperature;
        mode            coefficient;
        Ta              uniform 313;
        h               uniform 1000000;
        thicknessLayers ( 1 2 );
        kappaLayers     ( 100 200 );
        kappaMethod     solidThermo;
        kappa           none;
        value           uniform 300;
    }
    floor_to_domain0
    {
        type            zeroGradient;
        value           uniform 300;
    }
    floor_to_air
    {
        type            turbulentTemperatureRadCoupledMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     solidThermo;
        QrNbr           Qr;
        Qr              none;
        kappa           none;
    }
    floor_to_solid
    {
        type            turbulentTemperatureRadCoupledMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     solidThermo;
        QrNbr           none;
        Qr              none;
        kappa           none;
    }
}


// ************************************************************************* //
