HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/externalSolarLoad/system/air/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        air_to_floor
        {
            inGroups    2(wall viewFactorWall);
            sampleMode  nearestPatchFace;
        }

        air_to_solid
        {
            inGroups    2(wall viewFactorWall);
            sampleMode  nearestPatchFace;
        }
    }
    U
    {
        boundaryField
        {
             ".*"
            {
                type            pressureInletOutletVelocity;
                value           uniform (0 0 0);
                phi             phi;
            }

            region0_to_floor_floor_zone
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }
            "air.*"
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }
        }
    }

    T
    {
        internalField   uniform 300;
        boundaryField
        {
             ".*"
            {
                type            inletOutlet;
                value           uniform 300;
                inletValue      uniform 300;
            }

            "air.*"
            {
                type            turbulentTemperatureRadCoupledMixed;
                Tnbr            T;
                kappaMethod     fluidThermo;
                QrNbr           none;
                Qr              Qr;
                kappa           none;
                thermalInertia  true;
                value           uniform 300;
            }
        }
    }

    epsilon
    {
        internalField   uniform 0.01;
        boundaryField
        {
             ".*"
            {
                type            inletOutlet;
                inletValue      uniform 0.01;
                value           uniform 0.01;
            }

            "air.*"
            {
                type            epsilonWallFunction;
                value           uniform 0.01;
            }

        }
    }

    k
    {
        internalField   uniform 0.1;
        boundaryField
        {
             ".*"
            {
                type            inletOutlet;
                inletValue      uniform 0.1;
                value           uniform 0.1;
            }

            "air.*"
            {
                type            kqRWallFunction;
                value           uniform 0.1;
            }

        }
    }

    p_rgh
    {
        internalField   uniform 1e5;
        boundaryField
        {
            ".*"
            {
                type            totalPressure;
                p0              $internalField;
            }

            "air.*"
            {
                type            fixedFluxPressure;
                value           uniform 1e5;
            }

        }
    }

    p
    {
        internalField   uniform 1e5;
        boundaryField
        {
            ".*"
            {
                type            calculated;
                value           uniform 1e5;
            }
        }
    }

    IDefault
    {
        internalField   uniform 0;
        boundaryField
        {
            ".*"
            {
                type            greyDiffusiveRadiation;
                value           uniform 0;
            }
        }
    }


}

// ************************************************************************* //
