HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/externalSolarLoad/system/floor/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        floor_to_domain3
        {
            type        patch;
            sampleMode  nearestPatchFace;
        }
        ".*_to_.*"
        {
            sampleMode      nearestPatchFace;
        }
    }
    T
    {
        internalField   uniform 300;

        boundaryField
        {
            ".*"
            {
                type    zeroGradient;
                value   uniform 300;
            }

            floor_to_solid
            {
                type            turbulentTemperatureRadCoupledMixed;
                Tnbr            T;
                kappaMethod     solidThermo;
                QrNbr           none;
                Qr              none;
                kappa           none;
                thermalInertia  true;
                value           uniform 300;
            }

            floor_to_air
            {
                type            turbulentTemperatureRadCoupledMixed;
                Tnbr            T;
                kappaMethod     solidThermo;
                QrNbr           Qr;
                Qr              none;
                kappa           none;
                thermalInertia  true;
                value           uniform 300;
            }

            floor_to_domain3
            {
                type    zeroGradient;
                value   uniform 300;
            }

            minZ
            {
                type            externalWallHeatFluxTemperature;
                mode            coefficient;
                Ta              uniform 313.0;
                h               uniform 10e5;
                kappaMethod     solidThermo;
                kappa           none;
                thicknessLayers (1 2);
                kappaLayers     (100 200);
                value           uniform 300.0;
            }
        }
    }
}

// ************************************************************************* //
