HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/externalSolarLoad/system/solid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        solid_to_domain0
        {
            type        patch;
            sampleMode  nearestPatchFace;
        }
        ".*_to_.*"
        {
            sampleMode      nearestPatchFace;
        }
    }
    T
    {
        internalField   uniform 300;

        boundaryField
        {
            solid_to_air
            {
                type            turbulentTemperatureRadCoupledMixed;
                Tnbr            T;
                kappaMethod     solidThermo;
                QrNbr           Qr;
                Qr              none;
                kappa           none;
                thermalInertia  true;
                value           uniform 300;
            }

            solid_to_floor
            {
                type            turbulentTemperatureRadCoupledMixed;
                Tnbr            T;
                kappaMethod     solidThermo;
                QrNbr           none;
                Qr              none;
                kappa           none;
                thermalInertia  true;
                value           uniform 300;
            }

            solid_to_domain0
            {
                type            fixedValue;
                value           uniform 300.0;
            }
        }
    }
}

// ************************************************************************* //
