HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/externalSolarLoad/Allrun-parallel
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

# Setup case
./Allrun.pre

#-- Run in parallel

# Decompose
runApplication decomposePar -allRegions -constant

# Agglomerate patch faces
for i in air
do
    runParallel -s $i -np 4 \
        faceAgglomerate -region $i -dict constant/viewFactorsDict
done

# Generate view factors
for i in air
do
     runParallel -s $i -np 4 \
        viewFactorsGen -region $i
done

# set the initial fields
restore0Dir

runParallel $(getApplication)

# Reconstruct
runApplication reconstructPar -allRegions

echo
echo "creating files for paraview post-processing"
echo
paraFoam -touchAll

# -----------------------------------------------------------------------------
