HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/externalSolarLoad/Allrun.pre
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication topoSet
runApplication splitMeshRegions -cellZones -overwrite

# Remove unwanted region
rm -r 0/domain0
rm -r constant/domain0
rm -r system/domain0

# remove fluid fields from solid regions (important for post-processing)
for i in solid floor
do
   rm -f 0*/$i/{rho,mut,alphat,epsilon,k,U,p_rgh,Qr,G,IDefault}
done

# set the initial fields
restore0Dir

for i in air solid floor
do
    runApplication -s $i changeDictionary -region $i -subDict dictionaryReplacement
done

# -----------------------------------------------------------------------------
